In [2]:
import seaborn as sb

df = sb.load_dataset('tips')
conn = "sqlite:///example"
df.to_sql(
            'tips',            
            conn,                
            if_exists='replace'
           )

244

In [6]:
import pandas as pd
query_result = pd.read_sql("""
            SELECT total_bill, tip, sex, RANK() OVER (ORDER BY total_bill DESC) AS Rank
            FROM tips
            WHERE time='Dinner'
            """, con=conn)
query_result.head()

   total_bill    tip   sex  Rank
0       50.81  10.00  Male     1
1       48.33   9.00  Male     2
2       48.27   6.73  Male     3
3       48.17   5.00  Male     4
4       45.35   3.50  Male     5